{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--1217360b-f9d5-4db3-bff6-35741e8f7f37",
    "created": "2024-08-14T07:36:41.207289Z",
    "modified": "2024-08-14T07:36:41.207289Z",
    "name": "Forward Resolution IP Denylisting",
    "description": "Blocking a DNS lookup's answer's IP address value.",
    "x_d3fend_id": "D3-FRIDL",
    "x_kb_article": "## How it works\n\nThis technique prevents a client from learning IP addresses deemed to be potentially malicious, which would have been delivered via forward resolution responses.\n\nResponses to forward resolution requests (that is, requests where a domain is sent and IP(s) are returned) are collected, and the IP address(es) included as a response are examined. If the IP address(es) are in a range included in the blacklist, then the response is dropped and not forwarded to the client.\n\nThe DNS lookup can be blocked by either dropping the network traffic with an inline device, or modifying the value of the response sent by the DNS server. To transparently prevent client applications from hanging on a request, it is common practice to replace malicious values with addresses in the range 127.0.0.0/8 or the address of a honeypot maintained by the network administrators.\n\n## Considerations\n\n* This technique does not prevent the client from contacting the blacklisted IP, only from learning about this IP address via a nameserver lookup request.\n* DNS Response traffic can be transmitted over many different protocols, which presents a challenge to implementing methods to extract all DNS answer IP address value(s).\n  * DNS has historically used UDP port 53, with TCP port 53 instead used for responses over 512 bytes or after a lack of response over UDP.\n  * Usage of new protocols to provide confidentiality for DNS traffic, such as DoH (DNS over HTTPS) and DoT (DNS over TLS), complicates collection of the IP address(es) in DNS responses. These protocols have often been enabled in browser settings transparently after a browser update, with DNS requests proxied over one of these cryptographic protocols through a specified host.\n* This technique must be implemented logically between the application that receives the response and the server which sent the response.\n  * DNS responses sent in an encrypted manner, such as those using DoH or DoT, will require interception of the TLS connections in order to determine the IP address(es) in the response.\n* Replacing the response is not effective in the case that the nameserver uses a technique to provide integrity of its responses, such as DNSSEC for DNS responses.",
    "x_synonym": "Forward Resolution IP Blacklisting"
}