{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--13f7da0c-e73d-4aaf-a618-7e85d079b4a4",
    "created": "2024-08-14T07:36:36.74812Z",
    "modified": "2024-08-14T07:36:36.74812Z",
    "name": "Reference - System and methods thereof for logical identification of malicious threats across a plurality of end-point devices (epd) communicatively connected by a network - Palo Alto Networks IncCyber Secdo Ltd",
    "description": "No description available",
    "x_kb_abstract": "A computerized method for logical identification of malicious threats across a plurality of end-point devices (EPD) communicatively connected by a network, comprising collecting over the network an identifier associated with each file of a plurality of files, wherein each file of the plurality of files is installed on at least one of the plurality of EPDs and wherein the identifier is the same for each like file of the plurality of file. Information associated with an identified subset of files is collected, wherein the information indicates at least a time at which the at least one file was installed on one or more of the plurality of EPDs and the way the at least one file spread within the network. The collected information is analyzed according to a set of predetermined computerized investigation rules. The analysis is used to determine whether at least a file of the identified subset files is a suspicious file.",
    "x_kb_author": "Gil BARAK",
    "x_kb_mitre_analysis": "This patent describes detecting suspicious files using file metadata such as the prevalence of the file deployed on the network, file installation times, and how the file was spread within the network. The combination of these factors are used to determine a risk score of the file and if below a threshold, sends an alert.",
    "x_kb_organization": "Palo Alto Networks IncCyber Secdo Ltd",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#FileContentRules",
    "x_kb_reference_title": "System and methods thereof for logical identification of malicious threats across a plurality of end-point devices (epd) communicatively connected by a network"
}