{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--21f24dde-24ab-4c09-a65b-ba86ddae0df4",
    "created": "2024-08-14T07:36:36.65272Z",
    "modified": "2024-08-14T07:36:36.65272Z",
    "name": "Credential Compromise Scope Analysis",
    "description": "Determining which credentials may have been compromised by analyzing the user logon history of a particular system.",
    "x_d3fend_id": "D3-CCSA",
    "x_kb_article": "## How it works\n\n#### Memory\nCredentials may be stored in memory for a variety of reasons; on Windows, they may be stored in lsass.exe.  Once a credential dumper like mimikatz runs and dumps the memory of lsass.exe, the credentials of every account logged on since boot are potentially compromised.\nWhen such an event occurs, this analytic will give the forensic context to identify compromised users. Those users could potentially be used in later events for additional logons.\n\n\n#### Hard disk\nOperating System may cache a certain number of credentials onto the hard disk to use as a source of truth if it cannot contact the credential server.  In many versions of Microsoft Windows, the 10 most recent are cached by default; this setting can be changed in the Microsoft Management Console's Local Security Policy: ```Computer Configuration -> Windows Settings -> Local Policy -> Security Options -> Interactive Logon: Number of previous logons to cache -> 0```  Here we are not concerned with the alteration of the credentials but the fact that they might be read.  If the attacker has physical access to the machine they are unlikely to be stopped from reading files on the filesystem.\n\"In the event that the domain controller is unavailable Windows will check the last password hashes that has been cached in order to authenticate the user with the system. These password hashes are cached in the following registry setting:\nHKEY_LOCAL_MACHINE\\SECURITY\\Cache\nMimikatz can retrieve these hashes if the following command is executed:\nlsadump::cache\" [1]\n\nThe Registry Hive, HKEY_LOCAL_MACHINE\\SAM, which is stored in the supporting files %systemroot%\\System32\\Config\\{Sam,sam.log,sam.sav}, contains the SAM file.\n\nDC: This is stored in %systemroot%\\ntds\\ntds.dit. (https://www.ultimatewindowssecurity.com/blog/default.aspx?d=10/2017)\n\nSometimes memory, which contains credentials, could get on the hard disk. Like with hiberfil.sys in Windows.  Equivalent on Linux\n\n\nIn Linux, an attacker could read the /etc/shadow file.\n\nReading from /proc directory: mimipenguin, many others.\n\n## Considerations\nEffective implementation requires identifying any location that could end up containing credentials, and detecting an method of potential access to a source of credential data.\n\n1. https://medium.com/blue-team/preventing-mimikatz-attacks-ed283e7ebdd5"
}