{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--2674d41a-1b36-4279-848d-a14da0a6adaa",
    "created": "2024-08-14T07:36:38.259504Z",
    "modified": "2024-08-14T07:36:38.259504Z",
    "name": "Reference - System and method for internet security - Cylance Inc",
    "description": "No description available",
    "x_kb_abstract": "A computer implemented method for preventing SQL injection attacks comprises intercepting a web request associated with a web service at a first software hook in a first web service execution context, persisting at least a portion of the intercepted web request in a storage location associated with the first software hook and accessible to at least one additional execution context, intercepting a database query generated by at least one web service processing operation at a second software hook associated with the execution of the query, wherein the query is generated in response to the intercepted web request and the second hook retrieves the persisted portion of the intercepted web request, comparing a portion of the persisted portion of the intercepted web request with at least a portion of the intercepted database query, and determining, prior to the query being executed, whether the query corresponds to a potential SQL injection attack.",
    "x_kb_author": "Derek A. Soeder",
    "x_kb_mitre_analysis": "This patent describes a technique for detecting SQL injection attacks. Software hooks are installed in a web service or application to intercept function calls, events, or messages that are passed between software components. Intercepted database queries associated with a web request are analyzed character by character and if it contains a character that would modify the syntax the query is rejected or sanitized. Security rules and policies may also determine rejection. For example, an administrator or developer may implement a rule that rejects any database query that is excessively long or that contains a particular string, such as \"Xp cmdshell\".",
    "x_kb_organization": "Cylance Inc",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#DatabaseQueryStringAnalysis",
    "x_kb_reference_title": "System and method for internet security"
}