{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--6979a8c9-72eb-48c3-867a-c25ad297437d",
    "created": "2024-08-14T07:36:38.548784Z",
    "modified": "2024-08-14T07:36:38.548784Z",
    "name": "Reference - Hardware-assisted system and method for detecting and analyzing system calls made to an operting system kernel - Endgame Inc",
    "description": "No description available",
    "x_kb_abstract": "The present disclosure relates to a system and method for monitoring system calls to an operating system kernel. A performance monitoring unit is used to monitor system calls and to gather information about each system call. The information is gathered upon interrupting the system call and can include system call type, parameters, and information about the calling thread/process, in order to determine whether the system call was generated by malicious software code. Potentially malicious software code is nullified by a malicious code counter-attack module.",
    "x_kb_author": "Matthew D. Spisak",
    "x_kb_mitre_analysis": "This patent describes a technique for monitoring system calls to detect malicious software code. A system call monitoring module operates at the kernel level and traps system calls.\nMonitoring data includes:\n\n* information about the path to the file to be accessed by a system call.\n* the memory address or range of addresses to be accessed by a system call.\n* the context for the thread within operating system that will be interrupted by a system call.\n* the type of system call information about the socket that is being used by system call in order to send or receive data.\n* the history of system calls in order to monitor for specific sequences of system calls.\n* the frequency or periodicity of a particular system call or set of systems calls.\n\nCaptured system call data is analyzed using data analysis algorithms such as machine learning algorithms, artificial intelligence algorithms, pattern recognition algorithms, or other known data analysis techniques. An alert is generated if it is likely that the system call was generated by malicious software code.",
    "x_kb_organization": "Endgame Inc",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#SystemCallAnalysis",
    "x_kb_reference_title": "Hardware-assisted system and method for detecting and analyzing system calls made to an operting system kernel"
}