{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--7b68a0aa-bb08-4e2e-99c3-b61f0c6ec11c",
    "created": "2024-08-14T07:36:40.532178Z",
    "modified": "2024-08-14T07:36:40.532178Z",
    "name": "Reference - System and method thereof for identifying and responding to security incidents based on preemptive forensics - Palo Alto Networks Inc",
    "description": "No description available",
    "x_kb_abstract": "A system is connected to a plurality of user devices coupled to an enterprise's network. The system continuously collects, stores, and analyzes forensic data related to the enterprise's network. Based on the analysis, the system is able to determine normal behavior of the network and portions thereof and thereby identify abnormal behaviors within the network. Upon identification of an abnormal behavior, the system determines whether the abnormal behavior relates to a security incident. Upon determining a security incident in any portion of the enterprise's network, the system extracts forensic data respective of the security incident and enables further assessment of the security incident as well as identification of the source of the security incident. The system provides real-time damage assessment respective of the security incident as well as the security incident's attributions.",
    "x_kb_author": "Gil BARAK; Shai MORAG",
    "x_kb_mitre_analysis": "This patent describes detecting abnormal behavior related to a security incident by collecting and analyzing forensic data in real time. Forensic data may include:\n\n* URLs visited\n* data downloaded or streamed\n* messages received and sent\n* amount of memory used for processing\n\nThe data is then analyzed according to a set of dynamically created rules to determine normal behavior patterns associated with the network or user devices. Anomalies between current behavior and normal behavior patterns trigger an alert.",
    "x_kb_organization": "Palo Alto Networks Inc",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#ResourceAccessPatternAnalysis",
    "x_kb_reference_title": "System and method thereof for identifying and responding to security incidents based on preemptive forensics"
}