{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--94f4edc5-65c0-410f-85c4-2923637bccd3",
    "created": "2024-08-14T07:36:37.268334Z",
    "modified": "2024-08-14T07:36:37.268334Z",
    "name": "Reference - NIST Special Publication 800-160 Volume 1 - System Security Engineering",
    "description": "No description available",
    "x_kb_abstract": "With the continuing frequency, intensity, and adverse consequences of cyber-attacks, disruptions, hazards, and other threats to federal, state, and local governments, the military, businesses, and the critical infrastructure, the need for trustworthy secure systems has never been more important to the long-term economic and national security interests of the United States. Engineering-based solutions are essential to managing the growing complexity, dynamicity, and interconnectedness of today’s systems, as exemplified by cyber-physical systems and systems-of-systems, including the Internet of Things. This publication addresses the engineering-driven perspective and actions necessary to develop more defensible and survivable systems, inclusive of the machine, physical, and human components that compose the systems and the capabilities and services delivered by those systems. It starts with and builds upon a set of well-established International Standards for systems and software engineering published by the International Organization for Standardization (ISO), the International Electrotechnical Commission (IEC), and the Institute of Electrical and Electronics Engineers (IEEE) and infuses systems security engineering methods, practices, and techniques into those systems and software engineering activities. The objective is to address security issues from a stakeholder protection needs, concerns, and requirements perspective and to use established engineering processes to ensure that such needs, concerns, and requirements are addressed with appropriate fidelity and rigor, early and in a sustainable manner throughout the life cycle of the system.",
    "x_kb_author": "Ron Ross, Michael McEvilley, and Janet Carrier Oren",
    "x_kb_organization": "NIST",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#OperationalRiskAssessment",
    "x_kb_reference_title": "NIST Special Publication 800-160 Volume 1 - Systems Security Engineering"
}