{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--a9b9f341-172b-4c2d-8662-927c1d5e7656",
    "created": "2024-08-14T07:36:37.419044Z",
    "modified": "2024-08-14T07:36:37.419044Z",
    "name": "Reference - Tokenless biometric transaction authorization method and system",
    "description": "No description available",
    "x_kb_abstract": "A method and system for tokenless authorization of commercial transactions between a buyer and a seller using a computer system. A transaction is proposed by a seller, and the buyer signals his acceptance by entering his personal authentication information comprising a PIN and at least one biometric sample, forming a commercial transaction message. The commercial transaction message is forwarded to the computer system, where the computer system compares the personal authentication information in the commercial transaction message with previously registered buyer biometric samples. If the computer system successfully identifies the buyer, a financial account of the buyer is debited and a financial account of the seller is credited, and the results of the transaction are presented to both buyer and seller. As a result of the invention, a buyer can conduct commercial transactions without having to use any tokens such as portable man-made memory devices such as smartcards or swipe cards. The invention allows buyers to quickly select one of a group of different financial accounts from which to transfer funds. The invention further indicates to the user that the authentic computer system was accessed by the use of a private code that is returned to the buyer after the identification is complete. The invention additionally permits an authorized buyer to alert authorities in the event of an emergency, such as when a transaction is coerced.",
    "x_kb_organization": "SmartTouch Inc",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#BiometricAuthentication",
    "x_kb_reference_title": "Tokenless biometric transaction authorization method and system"
}