{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--b00e69bb-fe06-43de-a576-65b8e364a206",
    "created": "2024-08-14T07:36:38.73277Z",
    "modified": "2024-08-14T07:36:38.73277Z",
    "name": "Reference - System and methods thereof for causality identification and attributions determination of processes in a network - Palo Alto Networks IncCyber Secdo Ltd",
    "description": "No description available",
    "x_kb_abstract": "A system is used for detection of advanced persistent and non-persistent threats in a computerized environment. The system is connected to a plurality of user devices coupled to an enterprise's network. The system receives via an interface an electronic notification of at least one event in the operating system of the computer. The system then analyzes the at least one event. The system then generates a causality chain for the at least one event respective of the analysis. The causality chain comprises all the threads that attributed to the at least one event in a chronological order. The system then identifies a main thread that started the causality chain that led to the at least one event. Then, the system determines whether the main thread is associated with malicious software. Upon determination that the main thread is associated with malicious software, the causality chain is marked as infected.",
    "x_kb_author": "Gil BARAK",
    "x_kb_mitre_analysis": "This patent describes detecting malicious processes on a host. Agents are deployed on hosts that monitor all initiated processes and determine whether a process was initiated at boot or initiated by another process. If not initiated at boot or by another process, the process is identified as suspicious and an alert is triggered.",
    "x_kb_organization": "Palo Alto Networks IncCyber Secdo Ltd",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#ProcessLineageAnalysis",
    "x_kb_reference_title": "System and methods thereof for causality identification and attributions determination of processes in a network"
}