{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--b044ee56-b31c-426d-b239-148a92f952fe",
    "created": "2024-08-14T07:36:41.072024Z",
    "modified": "2024-08-14T07:36:41.072024Z",
    "name": "Reference - NIST Special Publication 800-37 Revision 2 - Risk Management Framework for Information Systems and Organizations",
    "description": "No description available",
    "x_kb_abstract": "This publication describes the Risk Management Framework (RMF) and provides guidelines for applying the RMF to information systems and organizations. The RMF provides a disciplined, structured, and flexible process for managing security and privacy risk that includes information security categorization; control selection, implementation, and assessment; system and common control authorizations; and continuous monitoring. The RMF includes activities to prepare organizations to execute the framework at appropriate risk management levels. The RMF also promotes near real-time risk management and ongoing information system and common control authorization through the implementation of continuous monitoring processes; provides senior leaders and executives with the necessary information to make efficient, cost-effective, risk management decisions about the systems supporting their missions and business functions; and incorporates security and privacy into the system development life cycle. Executing the RMF tasks links essential risk management processes at the system level to risk management processes at the organization level. In addition, it establishes responsibility and accountability for the controls implemented within an organization’s information systems and inherited by those systems.",
    "x_kb_organization": "NIST",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#OperationalRiskAssessment",
    "x_kb_reference_title": "NIST Special Publication 800-37 Revision 2 - Risk Management Framework for Information Systems and Organizations"
}