{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--c8be78d2-2109-41b8-9fb8-cba51632e48f",
    "created": "2024-08-14T07:36:40.572408Z",
    "modified": "2024-08-14T07:36:40.572408Z",
    "name": "Reference - System and Method for Detection of a Change in Behavior in the Use of a Website Through Vector Velocity Analysis - Silver Tail Systems",
    "description": "No description available",
    "x_kb_abstract": "A system and software for identifying the change of user behavior on a website includes analyzing the actions of users on a website comprising a plurality of fields or input parameters that identify the actions performed on a website including fields related to previous actions by that user or other users of the website. The fields or input parameters are represented in a vector format where vectors represent different sessions of activity on the website, pages of the website, users of the website, or other attributes of the use of a website. Analysis is performed to determine if new sessions are similar or dissimilar to previously known sessions and if a session is converging or diverging from known sessions based on the velocity and direction of the velocity of the vectors in the vector space.",
    "x_kb_author": "Mike Eynon; Laura Mather; Erik Westland; Jim Lloyd",
    "x_kb_mitre_analysis": "This patent describes a technique for detecting fraudulent behavior on a website. Website behavior is mapped to build a multidimensional representation of user actions on a website that is updated as additional actions are recorded. Example actions on a website that are recorded include clicks by a user on the website and entering data into forms. Current behavior is compared against baseline recorded behavior and if current behavior deviates above a threshold, an alert is issued.",
    "x_kb_organization": "Silver Tail Systems",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#WebSessionActivityAnalysis",
    "x_kb_reference_title": "System and Method for Detection of a Change in Behavior in the Use of a Website Through Vector Velocity Analysis"
}