{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--ce817272-6eca-45d4-b2a1-54d75717ca14",
    "created": "2024-08-14T07:36:40.596481Z",
    "modified": "2024-08-14T07:36:40.596481Z",
    "name": "Reference - Active firewall system and methodology - McAfee LLC",
    "description": "No description available",
    "x_kb_abstract": "System and methodology providing automated or \"proactive\" network security (\"active\" firewall) are described. The system implements methodology for verifying or authenticating communications, especially between network security components thereby allowing those components to share information. In one embodiment, a system implementing an active firewall is provided which includes methodology for verifying or authenticating communications between network components (e.g., sensor(s), arbiter, and actor(s)), using cryptographic keys or digital certificates. Certificates may be used to digitally sign a message or file and, in a complementary manner, to verify a digital signature. At the outset, particular software components that may participate in authenticated communication are specified, including creating a digital certificate for each such software component. Upon detection by a sensor that an event of interest that has occurred in the computer network system, the system may initiate authenticated communication between the sensor component and a central arbiter (e.g., \"event orchestrator\") component, so that the sensor may report the event to the arbiter or \"brain.\" Thereafter, the arbiter (if it chooses to act on that information) initiates authenticated communication between itself and a third software component, an \"actor\" component (e.g., \"firewall\"). The arbiter may indicate to the actor how it should handle the event. The actor or firewall, upon receiving the information, may now undertake appropriate action, such as dynamically creating or modifying rules for appropriately handling the event, or it may choose to simply ignore the information.",
    "x_kb_author": "Emilio Villa, Adrian Zidaritz, Michael David Varga, Gerhard Eschelbeck, Michael Kevin Jones, Mark James McArdle",
    "x_kb_organization": "McAfee LLC",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#InboundTrafficFiltering",
    "x_kb_reference_title": "Active firewall system and methodology"
}