{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--d83a444f-57ba-4f82-9ff2-52cf2a466836",
    "created": "2024-08-14T07:36:38.482244Z",
    "modified": "2024-08-14T07:36:38.482244Z",
    "name": "Remote Terminal Session Detection",
    "description": "Detection of an unauthorized remote live terminal console session by examining network traffic to a network host.",
    "x_d3fend_id": "D3-RTSD",
    "x_kb_article": "## How it works\nAn external attacker takes remote control of a host inside a company or organization's network and manually directs offensive techniques. Nonstandard terminal sessions and abnormal behaviors are analyzed in this technique. Abnormal behavior detection includes analysis of user input patterns in the real-time session, keyboard output and packet inspection.\n\n### Network Traffic Inspection\nNetwork traffic from internal hosts is the main concern and focus for the traffic inspection. The network traffic is collected into inspection groups. The groups of traffic are assembled into distinct pair flows (outbound/inbound) and the pair flows are further divided into sessions. Only sessions originated inside of the network are considered for the inspection. Traffic inspection includes analysis to determine if a human is involved in the session exchanges. Time-based statistics are captured for each session being analyzed by the detection engine.\n\n### Algorithm Analysis Description\nAnalysis algorithms look for patterns in the network traffic captured from the session data.  A detection engine groups the session traffic data, between the hosts, into rapid exchange instances. Analysis of rapid exchange traffic patterns can lead to the discovery of abnormal behavior which is indicative of a compromised internal host. The analysis algorithms look for patterns in the traffic which correlate to known activity (e.g., relay attacks, bot activity, bitcoin mining). Some metrics used during inspection include the following.\n\n* Number of rapid-exchange instances\n* Time interval between packets\n* Fixed cadence of traffic\n* Rhythm and direction of the initiation of instances\n* Volume of data flowing from internal to external controlling host\n* Data transfer characteristics\n* Variability in length of silent periods\n\n## Considerations\n* Full packet capture is required which can be process intensive to analyze\n* Attackers that move low and slow may blend in with existing traffic resulting in false negatives"
}