{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--ed1385ca-fd58-412f-98d1-0114ed3a8655",
    "created": "2024-08-14T07:36:37.956126Z",
    "modified": "2024-08-14T07:36:37.956126Z",
    "name": "Reference - Distributed meta-information query in a network - Bit 9 Inc",
    "description": "No description available",
    "x_kb_abstract": "A security system provides a defense from known and unknown viruses, worms, spyware, hackers, and social engineering attacks. The system can implement centralized policies that allow an administrator to approve, block, quarantine, and log file activities. A server associated with a number of hosts can provide a query for host computers to access security-related meta-information in local host stores. The query is pulled from the server by the hosts. The results of the distributed host query are stored and merged on the server, and exported for display, reports, or security response.",
    "x_kb_author": "Todd Brennan; John Hanratty",
    "x_kb_mitre_analysis": "Provides a mechanism to detect, monitor, locate, and control files installed on host computers. Each host has a host agent that analyzes file system activity and takes action based on policies configured on a server. The policies identify whether to block, log, allow, or quarantine actions such as file accesses and execution of executables. Examples of policies include:\n\n* Block/log execution of new executables and detached scripts (e.g., .exe or .bat)\n* Block/log reading/execution of new embedded content (e.g., macros in .doc)\n* Block/log installation/modification of Web content (alteration of content in .html or .cgi files)\n* Block/log execution of new files in an administratively defined 'class'; e.g., an administrator might want to block screen savers .scr, but not the entire class of executables .exe, .dll, .sys, etc . . .",
    "x_kb_organization": "Bit 9 Inc",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#FileContentRules",
    "x_kb_reference_title": "Distributed meta-information query in a network"
}