{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--ed38c07b-984f-42a6-8c6c-e442bb83d467",
    "created": "2024-08-14T07:36:37.089773Z",
    "modified": "2024-08-14T07:36:37.089773Z",
    "name": "Reference - Decoy Personas for Safeguarding Online Identity Using Deception - MITRE",
    "description": "No description available",
    "x_kb_abstract": "What if online scammers weren't sure whether the user account they are targeting is really yours, or whether the information they compiled about you is real? It's worth considering whether decoy online personas might help in the quest to safeguard our digital identities and data.\n\nI believe deception tactics, such as selective and careful use of honeypots, holds promise for defending enterprise IT resources. Some forms of deception could also protect individuals against online scammers and other attackers. This approach might not be quite practical today for most people, but in the future we might find it both necessary and achievable.\n\nHuman attackers and malicious software pursue user accounts and data on-line through harvesting, phishing, password-guessing, software vulnerabilities, and various other means. How might we use decoys to confuse, misdirect, slow down and detect adversaries engaged in such activities?\n\n...\n\nThe wealth of personal details available on social networking sites allows attackers to target individuals using social engineering, secret question-guessing and other techniques. For some examples of such approaches, see The Use of Fake or Fraudulent LinkedIn Profiles and Data Mining Resumes for Computer Attack Reconnaissance.\n\nSetting up one or more fake social network profiles (e.g., on Facebook) that use the person's real name can help the individual deflect the attack or can act as an early warning of an impending attack. A decoy profile could purposefully expose some inaccurate information, while the person's real profile would be more carefully concealed using the site's privacy settings. Decoy profiles would be associated with spamtrap email addresses.\n\nSimilarly, the person could expose decoy profiles on other sites, for instance those reveal shopping habits (e.g., Amazon), musings (e.g., Twitter), skills (e.g., GitHub), travel (e.g., TripIt), affections (e.g., Pinterest), music taste (e.g., Pandora) and so on. The person's decoy identities could also have fake resumes available on sites such as Indeed and Monster.com.",
    "x_kb_author": "Lenny Zeltser",
    "x_kb_organization": "SANS",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#DecoyPersona",
    "x_kb_reference_title": "Decoy Personas for Safeguarding Online Identity Using Deception"
}