{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--f600bd40-0355-4aa3-b0f3-ae1ce1848a12",
    "created": "2024-08-14T07:36:40.575994Z",
    "modified": "2024-08-14T07:36:40.575994Z",
    "name": "Reference - Decoy and deceptive data object technology - Cymmetria, Inc.",
    "description": "No description available",
    "x_kb_abstract": "A computer implemented method of detecting unauthorized access to a protected network by monitoring a dynamically updated deception environment, comprising launching, on one or more decoy endpoints, one or more decoy operating system (OS) managing one or more of a plurality of deception applications mapping a plurality of applications executed in a protected network, updating dynamically a usage indication for a plurality of deception data objects deployed in the protected network to emulate usage of the plurality of deception data objects for accessing the deception application(s) wherein the plurality of deception data objects are configured to trigger an interaction with the deception application(s) when used, detecting usage of data contained in the deception data object(s) by monitoring the interaction and identifying one or more potential unauthorized operations based on analysis of the detection.\n\nIn order to convince the potential attacker that the deception environment is the real (valid) processing environment and/or part thereof, the campaign manager may construct the false identity according to the public information of the certain user that may typically be available to the potential attacker. By exposing the real (public) information of the certain user to the potential attacker, the false identity may seem consistent and legitimate to the potential attacker. For example, the campaign manager may create a false account, for example, a Facebook account of the certain user that includes the same public information that is publicly available to other Facebook users from the real (genuine) Facebook account of the certain user. The fake company account may include information specific to the role and/or job title of certain user within the company, for example, a programmer, an accountant, an IT person and/or the like.",
    "x_kb_author": "Dean Sysman, Gadi Evron, Imri Goldberg, Itamar Sher, Shmuel Ur",
    "x_kb_organization": "Cymmetria, Inc.",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#DecoyPersona",
    "x_kb_reference_title": "Decoy and deceptive data object technology"
}