{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--f86ebc83-c862-4321-86c0-51f89539e9f8",
    "created": "2024-08-14T07:36:37.053498Z",
    "modified": "2024-08-14T07:36:37.053498Z",
    "name": "Reference - Systems and methods for detecting and/or handling targeted attacks in the email channel - Graphus Inc",
    "description": "No description available",
    "x_kb_abstract": "Techniques for detecting and/or handling target attacks in an enterprise's email channel are provided. The techniques include receiving aspects of an incoming email message addressed to a first email account holder, selecting a recipient interaction profile and/or a sender profile from a plurality of predetermined profiles stored in a memory based upon the received properties, determining a message trust rating associated with the incoming email message based upon the incoming email message and the selected recipient interaction profile and/or the sender profile; and generating an alert identifying the incoming email message as including a security risk based upon the determined message trust rating. The recipient interaction profile includes information associating the first email account holder and a plurality of email senders from whom email messages have previously been received for the first email account holder, and the sender profile includes information associating a sender of the incoming email message with characteristics determined from a plurality of email messages previously received from the sender.",
    "x_kb_author": "Manoj Kumar Srivastava",
    "x_kb_mitre_analysis": "The patent describes using sender trust rating and sender MTA trust rating as an indicator of level of email security risk.\n\n### Sender Reputation explanation\nThis patent includes Sender Reputation because it describes sender trust rating being used as an indicator of the level of security risk and/or trust level associated with an email sender. The sender trust rating may be determined based on one or more of:\n\n* length of time sender has known the enterprise\n* number of recipients in the enterprise the sender interacts with\n* sender vs. enterprise originated message ratio\n* sender messages open vs. not-open ratio\n* number of emails received from this sender\n* number of emails replied for this sender\n* number of emails from this sender not opened\n* number of emails from this sender not opened that contain an attachment\n* number of emails from this sender not opened that contain a URL\n* number of emails sent to this sender\n* number of email replies received from this sender\n\nBased on the trust rating an alert is generated identifying the incoming email message as a security risk.\n\n### Sender MTA Reputation explanation\nThis patent includes Sender MTA Reputation because it describes sender MTA trust rating as an indicator of the level of security risk and/or trust level associated with a sender MTA. The trust rating may be determined based on one or more of:\n\n* length of time MTA has interacted with the enterprise\n* number of sender domains sending emails from the MTA\n* number of recipients in the enterprise the MTA sends emails to\n* number of emails received from this MTA\n* number of email replies received from this MTA\n\nBased on the trust rating an alert is generated identifying the incoming email message as a security risk.",
    "x_kb_organization": "Graphus Inc",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#SenderMTAReputationAnalysis",
    "x_kb_reference_title": "Systems and methods for detecting and/or handling targeted attacks in the email channel"
}