{
    "type": "course-of-action",
    "spec_version": "2.1",
    "id": "course-of-action--fcd2209a-e319-4a0e-9c2d-82bb619542af",
    "created": "2024-08-14T07:36:40.602866Z",
    "modified": "2024-08-14T07:36:40.602866Z",
    "name": "Reference - Use of an application controller to monitor and control software file and application environments - Sophos Ltd",
    "description": "No description available",
    "x_kb_abstract": "In embodiments of the present invention, a framework for an extensible, file-based security system is described for determining an appropriate application, application environment, and/or access or security control measure based at least in part on a file's reputation. In response to the selection of a file, an application controller may be used to select a software application from two or more software applications to open the selected file, based at least in part on the selected file's reputation. If launched, a software application may be configured to open the file in an environment, such as a virtual machine, quarantined environment, and the like, that is appropriate for the file based at least in part on the reputation information. A software application may be a secure software application configured to manage secure files, or an insecure software application configured to manage insecure files. The selected file, and communications relating to the selected software application, may be managed according to the selected software application's secure or insecure configuration. Further, the selected software application may associate reputation information with all files that are modified and/or created by the selected software application, including at least in part, reputation information matching that of the selected file.",
    "x_kb_author": "Andrew J. Thomas",
    "x_kb_mitre_analysis": "This patent describes received files being open in an environment such as a virtual machine or quarantined environment to associate file reputation information that determines if a file is a threat.",
    "x_kb_organization": "Sophos Ltd",
    "x_kb_reference_of": "http://d3fend.mitre.org/ontologies/d3fend.owl#DynamicAnalysis",
    "x_kb_reference_title": "Use of an application controller to monitor and control software file and application environments"
}