{
    "type": "weakness",
    "spec_version": "2.1",
    "id": "weakness--5e82eb9d-aa81-4032-b65e-a3457130e67c",
    "created": "2024-08-13T14:46:48.979148Z",
    "modified": "2024-08-13T14:46:48.979148Z",
    "name": "Reliance on Obfuscation or Encryption of Security-Relevant Inputs without Integrity Checking",
    "description": "The product uses obfuscation or encryption of inputs that should not be mutable by an external actor, but the product does not use integrity checks to detect if those inputs have been modified.",
    "object_marking_refs": [
        "marking-definition--613f2e26-407d-48c7-9eca-b8e91df99dc9"
    ],
    "external_references": [
        {
            "source_name": "CWE",
            "external_id": "649"
        }
    ],
    "x_mitre_common_consequences": [
        {
            "impact": "Unexpected State",
            "scope": "Integrity"
        }
    ],
    "x_mitre_content_history": [
        {
            "submission_date": "2008-01-30",
            "submission_name": "Evgeny Lebanidze",
            "submission_organization": "Cigital"
        }
    ],
    "x_mitre_likelihood_of_exploit": "High",
    "x_mitre_observed_examples": [
        {
            "description": "An IPSec configuration does not perform integrity checking of the IPSec packet as the result of either not configuring ESP properly to support the integrity service or using AH improperly. In either case, the security gateway receiving the IPSec packet would not validate the integrity of the packet to ensure that it was not changed. Thus if the packets were intercepted the attacker could undetectably change some of the bits in the packets. The meaningful bit flipping was possible due to the known weaknesses in the CBC encryption mode. Since the attacker knew the structure of the packet, they were able (in one variation of the attack) to use bit flipping to change the destination IP of the packet to the destination machine controlled by the attacker. And so the destination security gateway would decrypt the packet and then forward the plaintext to the machine controlled by the attacker. The attacker could then read the original message. For instance if VPN was used with the vulnerable IPSec configuration the attacker could read the victim's e-mail. This vulnerability demonstrates the need to enforce the integrity service properly when critical data could be modified by an attacker. This problem might have also been mitigated by using an encryption mode that is not susceptible to bit flipping attacks, but the preferred mechanism to address this problem still remains message verification for integrity. While this attack focuses on the network layer and requires an entity that controls part of the communication path such as a router, the situation is not much different at the software level, where an attacker can modify tokens/parameters used by the application.",
            "link": "https://www.cve.org/CVERecord?id=CVE-2005-0039",
            "reference": "CVE-2005-0039"
        }
    ],
    "x_mitre_potential_mitigations": [
        {
            "description": "Protect important client controllable tokens/parameters for integrity using PKI methods (i.e. digital signatures) or other means, and checks for integrity on the server side.",
            "effectiveness": null,
            "phase": "Architecture and Design"
        },
        {
            "description": "Repeated requests from a particular user that include invalid values of tokens/parameters (those that should not be changed manually by users) should result in the user account lockout.",
            "effectiveness": null,
            "phase": "Architecture and Design"
        },
        {
            "description": "Client side tokens/parameters should not be such that it would be easy/predictable to guess another valid state.",
            "effectiveness": null,
            "phase": "Architecture and Design"
        },
        {
            "description": "Obfuscation should not be relied upon. If encryption is used, it needs to be properly applied (i.e. proven algorithm and implementation, use padding, use random initialization vector, user proper encryption mode). Even with proper encryption where the ciphertext does not leak information about the plaintext or reveal its structure, compromising integrity is possible (although less likely) without the provision of the integrity service.",
            "effectiveness": null,
            "phase": "Architecture and Design"
        }
    ],
    "x_mitre_related_weaknesses": [
        {
            "cwe_id": "345",
            "nature": "ChildOf"
        }
    ]
}