{
    "type": "relationship",
    "spec_version": "2.1",
    "id": "relationship--5a13e7b1-0314-4639-a807-f514722ab7d6",
    "created": "2024-08-13T14:51:21.948180Z",
    "modified": "2024-08-13T14:51:21.948182Z",
    "relationship_type": "detects",
    "source_ref": "x-mitre-data-component--f119ee6e-d69d-4f55-9ffa-502eafeeb53a",
    "target_ref": "malware-behavior--6aa8a176-6c7e-4d6a-92a3-b033f9f869f7",
    "object_marking_refs": [
        "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
    ],
    "external_references": [
        {
            "source_name": "Medium Detecting Attempts to Steal Passwords from Memory",
            "url": "https://medium.com/threatpunter/detecting-attempts-to-steal-passwords-from-memory-558f16dce4ea",
            "description": "French, D. (2018, October 2). Detecting Attempts to Steal Passwords from Memory. Retrieved October 11, 2019."
        }
    ],
    "description": "Monitor for unexpected processes interacting with lsass.exe.(Citation: Medium Detecting Attempts to Steal Passwords from Memory) Common credential dumpers such as [Mimikatz](https://attack.mitre.org/software/S0002) access the LSA Subsystem Service (LSASS) process by opening the process, locating the LSA secrets key, and decrypting the sections in memory where credential details are stored. Credential dumpers may also use methods for reflective [Process Injection](https://attack.mitre.org/techniques/T1055) to reduce potential indicators of malicious activity.\n##### Linux\nTo obtain the passwords and hashes stored in memory, processes must open a maps file in the /proc filesystem for the process being analyzed. This file is stored under the path <code>/proc/&lt;pid&gt;/maps</code>, where the <code>&lt;pid&gt;</code> directory is the unique pid of the program being interrogated for such authentication data. The AuditD monitoring tool, which ships stock in many Linux distributions, can be used to watch for hostile processes opening this file in the proc file system, alerting on the pid, process name, and arguments of such programs.",
    "x_mitre_version": "0.1",
    "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5"
}